Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/SUI_НастройкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументов</name>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинонимОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументаПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ComputerVision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмСозданияНовогоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияРеквизитовПередЗаписью</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСозданияДокументовНаОснованииПослеЗаписи</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалятьПустыеСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитов</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопоставлениеРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиВыводаДополнительныхПолей</name>
    <attributes>
      <name>РеквизитДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНаУстройстве</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/Forms/НастройкаТабличнойЧасти/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("КлючСвязи", КлючСвязи);
	Параметры.Свойство("ИмяДокумента", ИмяДокумента);
	Параметры.Свойство("ТипТаблицы", ТипТаблицы);
	Параметры.Свойство("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	
	Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(КлючСвязи) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не передан ключ связи.'"), , , , Отказ);
		Возврат;
	КонецЕсли;
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ИмяДокумента);	
	Если МетаданныеДокумента = Неопределено Или Не Метаданные.Документы.Содержит(МетаданныеДокумента) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось получить метаданные документа.'"), , , , Отказ);
		Возврат;
	КонецЕсли;
	
	ДоступныеТипыТаблиц.ЗагрузитьЗначения(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Параметры, "ДоступныеТипыТаблиц", Новый Массив(), Тип("Массив")));
		
	Если ДоступныеТипыТаблиц.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Отсутствуют доступные типы таблиц.'"), , , , Отказ);
		Возврат;
	КонецЕсли;
	
	ИнициализироватьЗначенияКлючейТаблицыСопоставлениеРеквизитовТЧ();
	
	СоответствияРеквизитовТЧ = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "СопоставленияРеквизитов", "", Тип("Строка")); 
	Если ЭтоАдресВременногоХранилища(СоответствияРеквизитовТЧ) Тогда
		
		ТаблицаКЗагрузке = ПолучитьИзВременногоХранилища(СоответствияРеквизитовТЧ);
		Если ТипЗнч(ТаблицаКЗагрузке) = Тип("ТаблицаЗначений") Тогда
			ЗагрузитьЗначенияТаблицыСопоставленияРеквизитовТЧ(ТаблицаКЗагрузке);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДоступныеТипыТаблиц.НайтиПоЗначению(ТипТаблицы) = Неопределено Тогда
		ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ПустаяСсылка();
	КонецЕсли;
	
	Элементы.СопоставлениеРеквизитовТЧ.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ТипТаблицы", ТипТаблицы));
	
	Для Каждого МетаданныеТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		Элементы.ИмяТабличнойЧасти.СписокВыбора.Добавить(МетаданныеТЧ.Имя, МетаданныеТЧ.Синоним);
	КонецЦикла;
	
	ЗагрузитьСписокВыбораЗначений();
	
	// Дополнительные реквизиты
	АлгоритмПолученияДополнительныхРеквизитов = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, 
		"АлгоритмПолученияДополнительныхРеквизитов");
		
	// Признак использования маркировки
	Элементы.ГруппаПризнакИспользованияМаркировки.Видимость = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Параметры, "ИспользованиеМаркировки", Ложь, Тип("Булево"));	
	АлгоритмПолученияПризнакаМаркировки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "АлгоритмПолученияПризнакаМаркировки");
	АлгоритмПолученияСтатусаУказанияСерии = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "АлгоритмПолученияСтатусаУказанияСерии");
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверитьЗначенияСопоставленныхРеквизитов();
	ОбновитьДоступностьИВидимостьЭлементов();
	ОбновитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВопросСохраненияПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Сохранить настройки?'"), РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипТаблицыПриИзменении(Элемент)
	
	Элементы.СопоставлениеРеквизитовТЧ.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ТипТаблицы", ТипТаблицы));
	ОбновитьДоступностьИВидимостьЭлементов();
	ОбновитьЗаголовокФормы();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТаблицыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ДоступныеТипыТаблиц;
КонецПроцедуры

&НаКлиенте
Процедура ИмяТабличнойЧастиПриИзменении(Элемент)
	
	ЗагрузитьСписокВыбораЗначений();
	ПроверитьЗначенияСопоставленныхРеквизитов();
	ОбновитьДоступностьИВидимостьЭлементов();
	ОбновитьЗаголовокФормы();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаРедактироватьАлгоритмПризнакПолученияМаркировкиНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(ИмяДокумента) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано имя документа'"));
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана табличная часть документа'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия(АлгоритмПолученияПризнакаМаркировки);
	
	ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Не Модифицированность;
	ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Получение признака маркировки из строки табличной части'");
	ПараметрыОткрытияРедактора.Описание = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru = 'Получение признака маркировки из строки табличной части ""%1"" документа ""%2"".
		|<span style=""font:ВажнаяНадписьШрифт"">
		|Результат выполнения алгоритма необходимо присвоить в <span style=""color: ГиперссылкаЦвет"">Параметры.Результат</span></span>'"), 
		ИмяТабличнойЧасти, ИмяДокумента);
	
	ДобавитьОписаниеПеременныхАлгоритма(
		ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, ИмяДокумента, ИмяТабличнойЧасти);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ГиперссылкаРедактироватьАлгоритмПризнакПолученияМаркировкиНажатиеЗавершение", ЭтотОбъект);
	ОткрытьРедакторКода(ОповещениеОЗавершении, ПараметрыОткрытияРедактора);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаРедактироватьАлгоритмПолученияСтатусаУказанияСерииНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(ИмяДокумента) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано имя документа'"));
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана табличная часть документа'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия(АлгоритмПолученияСтатусаУказанияСерии);
	
	ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Не Модифицированность;
	ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Получение статуса указания серии из строки табличной части'");
	ПараметрыОткрытияРедактора.Описание = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru = 'Получение статуса указания серии из строки табличной части ""%1"" документа ""%2"".
		|<span style=""font:ВажнаяНадписьШрифт"">
		|Результат выполнения алгоритма необходимо присвоить в <span style=""color: ГиперссылкаЦвет"">Параметры.Результат</span></span>'"), 
		ИмяТабличнойЧасти, ИмяДокумента);
	
	ДобавитьОписаниеПеременныхАлгоритма(
		ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, ИмяДокумента, ИмяТабличнойЧасти);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ГиперссылкаРедактироватьАлгоритмПолученияСтатусаУказанияСерииНажатиеЗавершение", ЭтотОбъект);
	ОткрытьРедакторКода(ОповещениеОЗавершении, ПараметрыОткрытияРедактора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСопоставлениеРеквизитовТЧ

&НаКлиенте
Процедура СопоставлениеРеквизитовТЧИспользуетсяПостоянноеЗначениеПриИзменении(Элемент)
	
	Если Элементы.СопоставлениеРеквизитовТЧ.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.СопоставлениеРеквизитовТЧ.ТекущиеДанные.ИспользуетсяПостоянноеЗначение Тогда
		Элементы.СопоставлениеРеквизитовТЧ.ТекущиеДанные.ИмяРеквизита = "";
	Иначе
		Элементы.СопоставлениеРеквизитовТЧ.ТекущиеДанные.ПостоянноеЗначение = Неопределено;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеРеквизитовТЧИмяРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если Элементы.СопоставлениеРеквизитовТЧ.ТекущиеДанные <> Неопределено Тогда
		СтандартнаяОбработка = Не Элементы.СопоставлениеРеквизитовТЧ.ТекущиеДанные.ИспользуетсяПостоянноеЗначение;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеРеквизитовТЧПостоянноеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элементы.СопоставлениеРеквизитовТЧ.ТекущиеДанные <> Неопределено Тогда
		СтандартнаяОбработка = Элементы.СопоставлениеРеквизитовТЧ.ТекущиеДанные.ИспользуетсяПостоянноеЗначение;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеРеквизитовТЧИмяРеквизитаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеРеквизитовТЧПостоянноеЗначениеПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьИЗакрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлгоритмПолученияДополнительныхРеквизитов(Команда)
	
	Если Не ЗначениеЗаполнено(ИмяДокумента) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано имя документа'"));
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана табличная часть документа'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия(АлгоритмПолученияДополнительныхРеквизитов);
	
	ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Не Модифицированность;
	ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Получение дополнительных реквизитов из строки табличной части'");
	ПараметрыОткрытияРедактора.Описание = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru = 'Получение дополнительных реквизитов из строки табличной части ""%1"" документа ""%2"".
		|<span style=""font:ВажнаяНадписьШрифт"">
		|Результат выполнения алгоритма необходимо присвоить в <span style=""color: ГиперссылкаЦвет"">Параметры.Результат</span></span>'"), 
		ИмяТабличнойЧасти, ИмяДокумента);
	
	ДобавитьОписаниеПеременныхАлгоритма(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
		ИмяДокумента, ИмяТабличнойЧасти);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьАлгоритмПолученияДополнительныхРеквизитовЗавершение", 
		ЭтотОбъект);
	ОткрытьРедакторКода(ОповещениеОЗавершении, ПараметрыОткрытияРедактора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьЗначенияКлючейТаблицыСопоставлениеРеквизитовТЧ()
	
	// Тип таблицы Товары Начало
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары;
	НоваяСтрока.Поле = "Номенклатура";
	НоваяСтрока.ПредставлениеПоля = "Номенклатура";
	НоваяСтрока.ОбязательноеЗаполнение = Истина;
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары;
	НоваяСтрока.Поле = "Характеристика";
	НоваяСтрока.ПредставлениеПоля = "Характеристика";
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары;
	НоваяСтрока.Поле = "Серия";
	НоваяСтрока.ПредставлениеПоля = "Серия";
	
	//TODO: Сандалов закомментировал на время тестирования
	//НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	//НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары;
	//НоваяСтрока.Поле = "СтатусУказанияСерий";
	//НоваяСтрока.ПредставлениеПоля = "Статус указания серий";
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары;
	НоваяСтрока.Поле = "Упаковка";
	НоваяСтрока.ПредставлениеПоля = "Упаковка";
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары;
	НоваяСтрока.Поле = "ВидЦены";
	НоваяСтрока.ПредставлениеПоля = "Вид цены";
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары;
	НоваяСтрока.Поле = "Цена";
	НоваяСтрока.ПредставлениеПоля = "Цена";
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары;
	НоваяСтрока.Поле = "КоличествоПлан";
	НоваяСтрока.ПредставлениеПоля = "Количество (план)";
	НоваяСтрока.ОбязательноеЗаполнение = Истина;
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары;
	НоваяСтрока.Поле = "КоличествоФакт";
	НоваяСтрока.ПредставлениеПоля = "Количество (факт)";
	НоваяСтрока.ОбязательноеЗаполнение = Истина;
	// Тип таблицы Товары Конец
	
	// Тип таблицы Штрихкоды упаковок Начало
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок;
	НоваяСтрока.Поле = "ШтрихкодУпаковки";
	НоваяСтрока.ПредставлениеПоля = "Штрихкод упаковки";
	НоваяСтрока.ОбязательноеЗаполнение = Истина;
	// Тип таблицы Штрихкоды упаковок Конец
	
	// Тип таблицы Серии Начало
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии;
	НоваяСтрока.Поле = "Номенклатура";
	НоваяСтрока.ПредставлениеПоля = "Номенклатура";
	НоваяСтрока.ОбязательноеЗаполнение = Истина;
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии;
	НоваяСтрока.Поле = "Характеристика";
	НоваяСтрока.ПредставлениеПоля = "Характеристика";
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии;
	НоваяСтрока.Поле = "Серия";
	НоваяСтрока.ПредставлениеПоля = "Серия";
	НоваяСтрока.ОбязательноеЗаполнение = Истина;
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии;
	НоваяСтрока.Поле = "Склад";
	НоваяСтрока.ПредставлениеПоля = "Склад";
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии;
	НоваяСтрока.Поле = "КоличествоФакт";
	НоваяСтрока.ПредставлениеПоля = "Количество";
	// Тип таблицы Серии Конец
	
	// Тип таблицы Отбор Начало
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор;
	НоваяСтрока.Поле = "Номенклатура";
	НоваяСтрока.ПредставлениеПоля = "Номенклатура";
	НоваяСтрока.ОбязательноеЗаполнение = Истина;
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор;
	НоваяСтрока.Поле = "Характеристика";
	НоваяСтрока.ПредставлениеПоля = "Характеристика";
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор;
	НоваяСтрока.Поле = "Серия";
	НоваяСтрока.ПредставлениеПоля = "Серия";
	
	//TODO: Сандалов закомментировал на время тестирования
	//НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	//НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор;
	//НоваяСтрока.Поле = "СтатусУказанияСерий";
	//НоваяСтрока.ПредставлениеПоля = "Статус указания серий";
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор;
	НоваяСтрока.Поле = "Упаковка";
	НоваяСтрока.ПредставлениеПоля = "Упаковка";
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор;
	НоваяСтрока.Поле = "Ячейка";
	НоваяСтрока.ПредставлениеПоля = "Ячейка";
	НоваяСтрока.ОбязательноеЗаполнение = Истина;
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор;
	НоваяСтрока.Поле = "КоличествоПлан";
	НоваяСтрока.ПредставлениеПоля = "Количество (план)";
	НоваяСтрока.ОбязательноеЗаполнение = Истина;
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор;
	НоваяСтрока.Поле = "КоличествоФакт";
	НоваяСтрока.ПредставлениеПоля = "Количество (факт)";
	НоваяСтрока.ОбязательноеЗаполнение = Истина;
	// Тип таблицы Отбор Конец
	
	// Тип таблицы Размещение Начало
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение;
	НоваяСтрока.Поле = "Номенклатура";
	НоваяСтрока.ПредставлениеПоля = "Номенклатура";
	НоваяСтрока.ОбязательноеЗаполнение = Истина;
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение;
	НоваяСтрока.Поле = "Характеристика";
	НоваяСтрока.ПредставлениеПоля = "Характеристика";
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение;
	НоваяСтрока.Поле = "Серия";
	НоваяСтрока.ПредставлениеПоля = "Серия";
	
	//TODO: Сандалов закомментировал на время тестирования
	//НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	//НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение;
	//НоваяСтрока.Поле = "СтатусУказанияСерий";
	//НоваяСтрока.ПредставлениеПоля = "Статус указания серий";
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение;
	НоваяСтрока.Поле = "Упаковка";
	НоваяСтрока.ПредставлениеПоля = "Упаковка";
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение;
	НоваяСтрока.Поле = "Ячейка";
	НоваяСтрока.ПредставлениеПоля = "Ячейка";
	НоваяСтрока.ОбязательноеЗаполнение = Истина;
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение;
	НоваяСтрока.Поле = "КоличествоПлан";
	НоваяСтрока.ПредставлениеПоля = "Количество (план)";
	НоваяСтрока.ОбязательноеЗаполнение = Истина;
	
	НоваяСтрока = СопоставлениеРеквизитовТЧ.Добавить();
	НоваяСтрока.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение;
	НоваяСтрока.Поле = "КоличествоФакт";
	НоваяСтрока.ПредставлениеПоля = "Количество (факт)";
	НоваяСтрока.ОбязательноеЗаполнение = Истина;
	// Тип таблицы Размещение Конец
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЗначенияТаблицыСопоставленияРеквизитовТЧ(ТаблицаКЗагрузке)
	
	Для Каждого СтрокаТаблицыКЗагрузке Из ТаблицаКЗагрузке Цикл
		
		НайденныеСтроки = СопоставлениеРеквизитовТЧ.НайтиСтроки(
			Новый Структура("ТипТаблицы, Поле", ТипТаблицы, СтрокаТаблицыКЗагрузке.Поле));
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			НайденнаяСтрока.ИмяРеквизита = СтрокаТаблицыКЗагрузке.ИмяРеквизита;
			
			Если Не ЗначениеЗаполнено(НайденнаяСтрока.ИмяРеквизита) Тогда
				НайденнаяСтрока.ИспользуетсяПостоянноеЗначение = СтрокаТаблицыКЗагрузке.ИспользуетсяПостоянноеЗначение;
				НайденнаяСтрока.ПостоянноеЗначение = СтрокаТаблицыКЗагрузке.ПостоянноеЗначение;
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокВыбораЗначений()
	
	СписокВыбораРеквизитов.Очистить();
	Элементы.СопоставлениеРеквизитовТЧИмяРеквизита.СписокВыбора.Очистить();
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ИмяДокумента);
	
	Если МетаданныеДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеТЧ = МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
	
	Если МетаданныеТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого МетаданныеРеквизитаТЧ Из МетаданныеТЧ.Реквизиты Цикл
		СписокВыбораРеквизитов.Добавить(МетаданныеРеквизитаТЧ.Имя, МетаданныеРеквизитаТЧ.Синоним);
		Элементы.СопоставлениеРеквизитовТЧИмяРеквизита.СписокВыбора.Добавить(
			МетаданныеРеквизитаТЧ.Имя, МетаданныеРеквизитаТЧ.Синоним);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьИВидимостьЭлементов()
	
	Элементы.ИмяТабличнойЧасти.Доступность = ЗначениеЗаполнено(ТипТаблицы);
	Элементы.СопоставлениеРеквизитовТЧ.Доступность = (ЗначениеЗаполнено(ТипТаблицы) И ЗначениеЗаполнено(ИмяТабличнойЧасти));
	
	Элементы.ГруппаДополнительныеРеквизиты.Доступность = Ложь;
	Элементы.ГруппаПризнакИспользованияМаркировки.Доступность = Ложь;
	
	Если ЗначениеЗаполнено(ИмяТабличнойЧасти) И
		(ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Товары") Или 
		ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор") Или 
		ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение") Или 
		ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Серии") Или 
		ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок")) Тогда
		
		Элементы.ГруппаДополнительныеРеквизиты.Доступность = Истина;
		
		Если ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Товары") Или 
			ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор") Или 
			ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение") Тогда
			Элементы.ГруппаПризнакИспользованияМаркировки.Доступность = Истина;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗначенияСопоставленныхРеквизитов()
	
	НайденныеСтроки = СопоставлениеРеквизитовТЧ.НайтиСтроки(Новый Структура("ТипТаблицы", ТипТаблицы));
	
	Для Индекс = 0 По НайденныеСтроки.ВГраница() Цикл
		
		Если Не ПустаяСтрока(НайденныеСтроки[Индекс].ИмяРеквизита) И
			СписокВыбораРеквизитов.НайтиПоЗначению(НайденныеСтроки[Индекс].ИмяРеквизита) = Неопределено Тогда
			НайденныеСтроки[Индекс].ИмяРеквизита = "";
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитов()
	
	ОчиститьСообщения();
	
	Ошибки = Новый Массив();
	
	Если Не ЗначениеЗаполнено(ТипТаблицы) Тогда
		Ошибки.Добавить(НСтр("ru = 'Не выбран тип таблицы.'"));
		Поле = "ТипТаблицы";
	ИначеЕсли Не ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
		Ошибки.Добавить(НСтр("ru = 'Не выбрано имя табличной части.'"));
		Поле = "ИмяТабличнойЧасти";
	Иначе
		
		НайденныеСтроки = СопоставлениеРеквизитовТЧ.НайтиСтроки(Новый Структура("ТипТаблицы, ОбязательноеЗаполнение", ТипТаблицы, Истина));
		
		Для Индекс = 0 По НайденныеСтроки.ВГраница() Цикл
			
			Если Не ЗначениеЗаполнено(НайденныеСтроки[Индекс].ИмяРеквизита) Тогда
				
				Если НайденныеСтроки[Индекс].ИспользуетсяПостоянноеЗначение Тогда
					
					Если НайденныеСтроки[Индекс].ПостоянноеЗначение = Неопределено Тогда
						Ошибки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Для поля %1 не выбран тип постоянного значения.'"), НайденныеСтроки[Индекс].ПредставлениеПоля));
					КонецЕсли;
					
				Иначе
					Ошибки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Для поля %1 не сопоставлен реквизит табличной части.'"), НайденныеСтроки[Индекс].ПредставлениеПоля));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Поле = "СопоставлениеРеквизитовТЧ";
		
	КонецЕсли;
	
	Для Индекс = 0 По Ошибки.ВГраница() Цикл
		ОбщегоНазначенияКлиент.СообщитьПользователю(Ошибки[Индекс], , Поле);
	КонецЦикла;
		
	Возврат Ошибки.Количество() = 0;
	
КонецФункции

&НаКлиенте
Процедура СохранитьИЗакрыть()
	
	Если ПроверитьЗаполнениеРеквизитов() Тогда
		ПараметрыЗакрытия = ПодготовитьПараметрыЗакрытия();
		Модифицированность = Ложь;
		Закрыть(ПараметрыЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьПараметрыЗакрытия()
	
	ПараметрыЗакрытия = Новый Структура();
	
	ПараметрыЗакрытия.Вставить("КлючСвязи", КлючСвязи);
	ПараметрыЗакрытия.Вставить("ИмяДокумента", ИмяДокумента);
	ПараметрыЗакрытия.Вставить("ТипТаблицы", ТипТаблицы);
	ПараметрыЗакрытия.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	ПараметрыЗакрытия.Вставить("АлгоритмПолученияДополнительныхРеквизитов", АлгоритмПолученияДополнительныхРеквизитов);
	ПараметрыЗакрытия.Вставить("АлгоритмПолученияПризнакаМаркировки", АлгоритмПолученияПризнакаМаркировки);
	ПараметрыЗакрытия.Вставить("АлгоритмПолученияСтатусаУказанияСерии", АлгоритмПолученияСтатусаУказанияСерии);
	
	НайденныеСтроки = СопоставлениеРеквизитовТЧ.НайтиСтроки(Новый Структура("ТипТаблицы", ТипТаблицы));
	СопоставленияРеквизитов = СопоставлениеРеквизитовТЧ.Выгрузить(
		НайденныеСтроки, "Поле,ИмяРеквизита,ИспользуетсяПостоянноеЗначение,ПостоянноеЗначение");
	
	ПараметрыЗакрытия.Вставить("СопоставленияРеквизитов", ПоместитьВоВременноеХранилище(СопоставленияРеквизитов));
	
	Возврат ПараметрыЗакрытия;
	
КонецФункции

&НаКлиенте
Процедура ВопросСохраненияПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	Иначе 
		СохранитьИЗакрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокФормы()

	СинонимТипТаблицы = ?(ЗначениеЗаполнено(ТипТаблицы), Строка(ТипТаблицы), "Настройка табличной части");
	СинонимДокумента = "";
	СинонимТЧ = "";
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ИмяДокумента);
	
	Если МетаданныеДокумента <> Неопределено Тогда
		СинонимДокумента = МетаданныеДокумента.Синоним;
		МетаданныеТЧ = МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
		Если МетаданныеТЧ <> Неопределено Тогда
			СинонимТЧ = МетаданныеТЧ.Синоним;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(СинонимДокумента) И Не ПустаяСтрока(СинонимТЧ) Тогда
		Заголовок = СинонимТипТаблицы + ": " + СинонимТЧ + " (" + СинонимДокумента + ")";
	ИначеЕсли Не ПустаяСтрока(СинонимДокумента) И ПустаяСтрока(СинонимТЧ) Тогда
		Заголовок = СинонимТипТаблицы + " (" + СинонимДокумента + ")";
	ИначеЕсли ПустаяСтрока(СинонимДокумента) И Не ПустаяСтрока(СинонимТЧ) Тогда
		Заголовок = СинонимТипТаблицы + ": " + СинонимТЧ;
	Иначе
		Заголовок = СинонимТипТаблицы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаРедактироватьАлгоритмПризнакПолученияМаркировкиНажатиеЗавершение(Алгоритм, ДополнительныеПараметры) Экспорт
	
	Если Алгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АлгоритмПолученияПризнакаМаркировки = Алгоритм;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьОписаниеПеременныхАлгоритма(ПользовательскиеОбъекты, ИмяДокумента, ИмяТабличнойЧасти)
	
	// Описание переменных: Параметры
	ПользовательскийОбъектПараметры = SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(
		ПользовательскиеОбъекты, 
		"Параметры", 
		НСтр("ru = 'Входные параметры'"),
		Тип("Структура"),
		Тип("Структура"));
	
	// Описание переменных: Параметры.ДанныеСтроки
	ПользовательскийОбъект = SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
		ПользовательскийОбъектПараметры, 
		"ДанныеСтроки",
		"ДанныеСтроки", 
		СтрШаблон(НСтр("ru = 'Данные строки табличной части %1'"), ИмяТабличнойЧасти),
		Тип("Структура"));
	
	ОписаниеРеквизитов = SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента(ИмяДокумента);
	ОписаниеРеквизитов = ОписаниеРеквизитов.Строки.Найти("ТабличныеЧасти", "Имя", Ложь);
	
	Если ОписаниеРеквизитов <> Неопределено Тогда
		ОписаниеРеквизитов = ОписаниеРеквизитов.Строки.Найти(ИмяТабличнойЧасти, "Имя", Ложь);
	КонецЕсли;
	
	Если ОписаниеРеквизитов <> Неопределено Тогда
		
		Для Каждого ОписаниеРеквизитаТЧ Из ОписаниеРеквизитов.Строки Цикл
			
			SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
				ПользовательскийОбъект, 
				ОписаниеРеквизитаТЧ.Имя,
				ОписаниеРеквизитаТЧ.Синоним,
				ОписаниеРеквизитаТЧ.Представление,
				SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизитаТЧ.Тип),
				,
				Истина);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Описание переменных: Параметры.Результат
	SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
		ПользовательскийОбъектПараметры, 
		"Результат",
		"Результат",
		НСтр("ru = 'Результат выполнения алгоритма'"),
		"Булево",
		Тип("Булево"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлгоритмПолученияДополнительныхРеквизитовЗавершение(Алгоритм, ДополнительныеПараметры) Экспорт
	
	Если Алгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АлгоритмПолученияДополнительныхРеквизитов = Алгоритм;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаРедактироватьАлгоритмПолученияСтатусаУказанияСерииНажатиеЗавершение(Алгоритм, ДополнительныеПараметры) Экспорт
	
	Если Алгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АлгоритмПолученияСтатусаУказанияСерии = Алгоритм;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторКода(Оповещение, ПараметрыОткрытияРедактора)
	
	SUI_РедакторКодаКлиент.ОткрытьРедактор(ПараметрыОткрытияРедактора, Оповещение, ЭтотОбъект, , 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти
